urmumfat/Projekt-Grupowy-ID-656/code/STM32/ver1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define D1_Pin GPIO_PIN_1
#define D1_GPIO_Port GPIOC
#define D2_Pin GPIO_PIN_2
#define D2_GPIO_Port GPIOC
#define D3_Pin GPIO_PIN_3
#define D3_GPIO_Port GPIOC
#define Enk1_OA_Pin GPIO_PIN_0
#define Enk1_OA_GPIO_Port GPIOA
#define Enk1_OB_Pin GPIO_PIN_1
#define Enk1_OB_GPIO_Port GPIOA
#define Enk_OA_Pin GPIO_PIN_6
#define Enk_OA_GPIO_Port GPIOA
#define Enk2_OB_Pin GPIO_PIN_7
#define Enk2_OB_GPIO_Port GPIOA
#define Sil1_M1_Pin GPIO_PIN_6
#define Sil1_M1_GPIO_Port GPIOC
#define Sil1_M2_Pin GPIO_PIN_7
#define Sil1_M2_GPIO_Port GPIOC
#define Sil2_M1_Pin GPIO_PIN_8
#define Sil2_M1_GPIO_Port GPIOC
#define Sil2_M2_Pin GPIO_PIN_9
#define Sil2_M2_GPIO_Port GPIOC

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
